//=============================================================================
//
// カメラ処理 [camera_Ex.h]
// Author : GP-12B-191 22 程凱旋
//
//=============================================================================
#pragma once


//*****************************************************************************
// 僀儞僋儖乕僪僼傽僀儖
//*****************************************************************************
#include <d3dx9.h>

//*****************************************************************************
// 儅僋儘掕媊
//*****************************************************************************
struct CAMERA_EX
{
	D3DXVECTOR3			pos;			// 僇儊儔偺帇揰(埵抲)
	D3DXVECTOR3			at;				// 僇儊儔偺拲帇揰
	D3DXVECTOR3			up;				// 僇儊儔偺忋曽岦儀僋僩儖
	D3DXVECTOR3			rot;			// 僇儊儔偺夞揮
	float				len;			// 僇儊儔偺帇揰偲拲帇揰偺嫍棧
	float               lenAt;
	D3DXMATRIX			mtxView;		// 價儏乕儅僩儕僢僋僗
	D3DXMATRIX			mtxProjection;	// 僾儘僕僃僋僔儑儞儅僩儕僢僋僗
	D3DXMATRIX          mtxLoCombo;
};

//*****************************************************************************
// 僾儘僩僞僀僾愰尵
//*****************************************************************************
void InitCamera_Ex(void);
void UninitCamera_Ex(void);
void UpdateCamera_Ex(void);
void SetCamera_Ex();
CAMERA_EX *GetCamera_Ex();
D3DXPLANE *GetCamPlane_Ex(void);