//=============================================================================
//
// デバッグメッセージ[debugproc.h]
// Author : 
//
//=============================================================================
#pragma once


//*****************************************************************************
// 僾儘僩僞僀僾愰尵
//*****************************************************************************
HRESULT InitDebugProc(void);
void UninitDebugProc(void);
void UpdateDebugProc(void);
void DrawDebugProc(void);
void PrintDebugProc(char *fmt,...);

