//=============================================================================
//
// 僼僃乕僪張棟 [fade.h]
// Author : 
//
//=============================================================================
#pragma once


//*************************************
// 僼僃乕僪偺忬懺
//*************************************
enum FADE
{
	FADE_NONE = 0,		// 壗傕側偄忬懺
	FADE_IN,			// 僼僃乕僪僀儞張棟
	FADE_MUSIC_STOP,
	FADE_OUT,			// 僼僃乕僪傾僂僩張棟
	FADE_MAX
};

//*****************************************************************************
// 僾儘僩僞僀僾愰尵
//*****************************************************************************
HRESULT InitFade(int type);
void UninitFade(void);
void UpdateFade(void);
void DrawFade(void);

void SetFade(FADE fade);
FADE GetFade(void);

